In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [3]:
#Q 10
df10 = pd.read_sql_query("SELECT f.name as Court_name,sum(case when b.memid = 0 then b.slots*f.guestcost else b.slots*f.membercost end) as Total_revenue FROM `Bookings` b inner join `Facilities` f on b.facid = f.facid group by 1 HAVING sum(case when b.memid = 0 then b.slots*f.guestcost else b.slots*f.membercost end) < 1000 order by 2 DESC", engine)
print(df10)

      Court_name  Total_revenue
0     Pool Table            270
1  Snooker Table            240
2   Table Tennis            180

In [4]:
#Q11
df11 = pd.read_sql_query("SELECT m1.surname || ' ' || m1.firstname AS Member_Name, m2.surname || ' ' || m2.firstname as Recommendedby FROM `Members` m1 left join `Members` m2 on m1.recommendedby = m2.memid where m1.memid!=0 ORDER by 1",engine)
print(df11)

                Member_Name      Recommendedby
0            Bader Florence    Stibbons Ponder
1                Baker Anne    Stibbons Ponder
2             Baker Timothy     Farrell Jemima
3                Boothe Tim         Rownam Tim
4            Butters Gerald       Smith Darren
5               Coplin Joan      Baker Timothy
6             Crumpet Erica        Smith Tracy
7                Dare Nancy    Joplette Janice
8             Farrell David               None
9            Farrell Jemima               None
10          Genting Matthew     Butters Gerald
11                Hunt John  Purview Millicent
12              Jones David    Joplette Janice
13            Jones Douglas        Jones David
14          Joplette Janice       Smith Darren
15           Mackenzie Anna       Smith Darren
16             Owen Charles       Smith Darren
17             Pinker David     Farrell Jemima
18        Purview Millicent        Smith Tracy
19               Rownam Tim               None
20         Rumney Henrietta    Genting Matthew
21         Sarwin Ramnaresh     Bader Florence
22             Smith Darren               None
23             Smith Darren               None
24               Smith Jack       Smith Darren
25              Smith Tracy               None
26          Stibbons Ponder       Tracy Burton
27             Tracy Burton               None
28      Tupperware Hyacinth               None
29  Worthington-Smyth Henry        Smith Tracy

In [5]:
#Q12
df12 = pd.read_sql_query("SELECT f.name as Court_name,count(*) as Facility_Usage FROM `Bookings` b inner join `Facilities` f on b.facid = f.facid where b.memid!=0 group by 1 order by 2 DESC",engine)
print(df12)

        Court_name  Facility_Usage
0       Pool Table             783
1    Snooker Table             421
2   Massage Room 1             421
3     Table Tennis             385
4  Badminton Court             344
5   Tennis Court 1             308
6   Tennis Court 2             276
7     Squash Court             195
8   Massage Room 2              27

In [6]:
#Q13
df13 = pd.read_sql_query("SELECT f.name as Court_name, strftime('%m', b.starttime) as Month,count(*) as Facility_Usage FROM `Bookings` b inner join `Facilities` f on b.facid = f.facid where b.memid!=0 group by 1,2 order by 1,2",engine)
print(df13)

         Court_name Month  Facility_Usage
0   Badminton Court    07              51
1   Badminton Court    08             132
2   Badminton Court    09             161
3    Massage Room 1    07              77
4    Massage Room 1    08             153
5    Massage Room 1    09             191
6    Massage Room 2    07               4
7    Massage Room 2    08               9
8    Massage Room 2    09              14
9        Pool Table    07             103
10       Pool Table    08             272
11       Pool Table    09             408
12    Snooker Table    07              68
13    Snooker Table    08             154
14    Snooker Table    09             199
15     Squash Court    07              23
16     Squash Court    08              85
17     Squash Court    09              87
18     Table Tennis    07              48
19     Table Tennis    08             143
20     Table Tennis    09             194
21   Tennis Court 1    07              65
22   Tennis Court 1    08             111
23   Tennis Court 1    09             132
24   Tennis Court 2    07              41
25   Tennis Court 2    08             109
26   Tennis Court 2    09             126